<head>
	<meta charset="UTF-8">
</head>
<body>
	<?
	echo "<b>Домашнее задание Урок 3 Задача 4</b><br>";
	echo "Объявить массив, индексами которого являются буквы русского языка, а значениями –
соответствующие латинские буквосочетания (‘а’=> ’a’, ‘б’ => ‘b’, ‘в’ => ‘v’, ‘г’ => ‘g’, …, ‘э’ => ‘e’,
‘ю’ => ‘yu’, ‘я’ => ‘ya’).<br>Написать функцию транслитерации строк.<br>";
	echo "<br><b>Решение:</b><br>";
	
	# задаем кодировку по-умолчанию
	mb_internal_encoding("UTF-8");

	$translitTable = [
		"а" => "a",
		"б" => "b",
		"в" => "v",
		"г" => "g",
		"д" => "d",
		"е" => "e",
		"ё" => "yo",
		"ж" => "zh",
		"з" => "z",
		"и" => "i",
		"й" => "y",
		"к" => "k",
		"л" => "l",
		"м" => "m",
		"н" => "n",
		"о" => "o",
		"п" => "p",
		"р" => "r",
		"с" => "s",
		"т" => "t",
		"у" => "u",
		"ф" => "f",
		"х" => "kh",
		"ц" => "ts",
		"ч" => "ch",
		"ш" => "sh",
		"щ" => "shch",
		"ъ" => "``",
		"ы" => "y'",
		"ь" => "`",
		"э" => "e",
		"ю" => "yu",
		"я" => "ya",
	];

	$testString = "cъешь ещё этих мягких французских булок, да выпей же чаю.";

	/* использовал встроенную функцию поиска подстроки в строке
	   с поддержкой многобайтовых кодировок
	   в задании №5 использовал функцию преобразования строки в массив
	*/
	function getTranslitedString($str, $table) {
		for($i = 0; $i < mb_strlen($str); $i++){
			foreach($table as $key => $value) {
				if (mb_substr($str, $i, 1) === $key) {
					$str = str_replace($key, $value, $str);
				}
			}
		}
		return $str;
	}

	echo "<br>Исходная строка: " . $testString . "<br>";
	echo "Транслитерация по ГОСТ 7.79: " . getTranslitedString($testString, $translitTable) . "<br>";
	echo "Поддерживаются только строчные символы!"
	?>
</body>