<head>
	<meta charset="UTF-8">
</head>
<body>
	<?
	echo "<b>Домашнее задание Урок 3 Задача 8</b><br>";
	echo "Повторить третье задание, но вывести на экран только города, начинающиеся с буквы «К».<br>";
	echo "<br><b>Решение:</b><br>";

	$region = [
		"Алтайский край" => ["Барнаул", "Бийск", "Рубцовск", "Новоалтайск", "Заринск", "Камень-на-Оби"],
		"Забайкальский край" => ["Чита", "Краснокаменск", "Борзя", "Агинское", "Нерчинск", "Могоча"],
		"Камчатский край" => ["Петропавловск-Камчатский", "Елизово", "Вилючинск", "Мильково", "Ключи"],
		"Краснодарский край" => ["Краснодар", "Новороссийск", "Геленджик", "Горячий Ключ", "Сочи", "Армавир", "Анапа"],
		"Красноярский край" => ["Красноярск", "Норильск", "Ачинск", "Канск", "Железногорск"],
	];

	$filter_char = "К";
	foreach($region as $region_key => $arrayCity){
		echo $region_key . ":<br>";
		$countCity = count($arrayCity);
		for($i=0; $i < $countCity; $i++) {
			if (mb_substr($arrayCity[$i],0,1) !== $filter_char) {
				continue;
			}
			echo $arrayCity[$i] . " ";
		}
		echo "<br><br>";
	}
	?>


</body>